app/views/api/v1/jobs/show.json.jbuilder

json.extract! @job, :id, :position
if @job.shifts.count >= 1
  last_shift = [@job.shifts.last]
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."job_id" = $1 ORDER BY "shifts"."id" DESC LIMIT $2  [["job_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "shifts" WHERE "shifts"."job_id" = $1  [["job_id", 2]]

      json.id shift.user.id
      json.first_name shift.user.first_name
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]