app/controllers/api/v1/jobs_controller.rb

  def new_time_entry
    last_shift = @job.shifts.last
    if (last_shift && last_shift.clock_out) || !last_shift
      shift = Shift.new({
        job_id: @job.id,
        clock_in: Time.now,
        user_id: current_user.id
      })
    elsif !last_shift.clock_out
      shift = last_shift
      shift.clock_out = Time.now
    end
    shift.save
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."job_id" = $1 ORDER BY "shifts"."id" DESC LIMIT $2  [["job_id", 2], ["LIMIT", 1]]
INSERT INTO "shifts" ("clock_in", "job_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["clock_in", "2020-09-07 04:27:28.497339"], ["job_id", 2], ["user_id", 1], ["created_at", "2020-09-07 04:27:28.507177"], ["updated_at", "2020-09-07 04:27:28.507177"]]